package org.example.util;

/**
 * онстанты приложения
 */
public class Constant {

    /**
     * Навиация действия пользователя.
     */
    public static final String NAVIGATION = """
            Если вы хотите добавить привычку, введите: 1
            Если вы хотите посмотреть список ваших привычек, введите: 2
            Если вы хотите имзенить привычку, введите: 3
            Если вы хотите пометить привычку, введите: 4
            Если вы хотите посмотреть историю привычки, введите: 5
            Если вы хотите посмотреть статистику по привычке, введите: 6
            Если вы хотите удалить привычку, введите: 7
            Если вы хотите посмотреть информацию о вашем профиле, введите: 8
            Если вы хотите поменять профиль, введите: 9
            Если вы хотите поменять пароль, введите: 10
            Если вы хотите удалить свой аккаунт, введите: 11
            Если вы хотитее выйти из аккаунта, введите: 12
            """;

    /**
     * Навигация действий со списком привычек.
     */
    public static final String HABIT_LIST_NAVIGATION = """
            Если вы хотите посмотреть в порядке убывания по дате, введите: 1
            Если вы хотите посмотреть в порядке возрастания по дате, введите: 2
            Если вы хотите посмотреть с ежедневной периодичностью, введите: 3
            Если вы хотите посмотреть с еженедельной периодичностью, введите: 4
            
            Если хотите вернуться, введите: 5
            """;
}
